export const tasks = [
    {
        id: "1",
        link: '/projects/1',
        title: 'Notes',
        subtitle: 'Приложение "Notes" представляет собой веб-приложение, позволяющее пользователям создавать, редактировать и управлять своими заметками. Он обладает интуитивно понятным пользовательским интерфейсом, который позволяет легко организовывать информацию и делиться ею.',
        techStack: 
        [
         "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/react/react-original.svg",
         "https://user-images.githubusercontent.com/2182637/53611918-54c1ff80-3c24-11e9-9917-66ac3cef513d.png",
         "https://cdn.icon-icons.com/icons2/2699/PNG/512/inext_logo_icon_170002.png",
         "https://www.svgrepo.com/show/354262/react-router.svg"
        ],
        article: 'Разработка веб-приложения "Notes" стала настоящим вызовом, особенно когда пришлось оптимизировать производительность при работе с большим количеством заметок. Одной из самых интересных задач было внедрение функций совместного редактирования заметок в реальном времени, что потребовало использования веб-сокетов и глубокого понимания принципов работы серверов.',
    },
    {
        id: "2",
        link: '/projects/2',
        title: 'Quiz',
        subtitle: 'Этот проект - платформа для проведения квизов по программированию с личным кабинетом для пользователей и административной панелью для создания и управления квизами. Платформа также предоставляет возможность отслеживания прогресса пользователей в прохождении квизов.',
        techStack: 
        [
         "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/react/react-original.svg",
         "https://www.svgrepo.com/show/354262/react-router.svg"
        ],
        article: 'Создание платформы для проведения квизов по программированию оказалось сложной задачей из-за необходимости интеграции различных типов вопросов и автоматической оценки результатов. Особенно интересно было разрабатывать алгоритмы, которые адаптируют сложность вопросов в зависимости от уровня подготовки пользователя, обеспечивая персонализированный и увлекательный опыт обучения.',
    },
    {
        id: "3",
        link: '/projects/3',
        title: 'Vacancy Hunter',
        subtitle: 'Данное приложение представляет собой бота для мессенджера Telegram, который выполняет функции мониторинга и выдачи интересующих нас вакансий по запросу пользователя.',
        techStack: 
        [
         "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/nodejs/nodejs-original.svg",
         "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/jest/jest-plain.svg",
         "https://raw.githubusercontent.com/grammyjs/website/main/logos/grammY.png",
        ],
        article: 'Создание Telegram-бота для мониторинга вакансий стало интересным проектом, особенно в части парсинга данных с различных сайтов и их фильтрации по запросам пользователей. Применение машинного обучения для улучшения подбора вакансий стало отличной возможностью повысить точность и релевантность предложений для пользователей.',
    },
    {
        id: "4",
        link: '/projects/4',
        title: 'Page With Search Engine',
        subtitle: 'Эта страница с поисковиком — проект, направленный на создание поисковой системы для конспектов лекций и ответов на тесты. Он предоставляет студентам удобный способ найти необходимые материалы для учебы.',
        techStack: 
        [
         "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/angular/angular-original.svg",
         "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Typescript_logo_2020.svg/2048px-Typescript_logo_2020.svg.png",
         "https://cdn.jsdelivr.net/gh/devicons/devicon@latest/icons/nodejs/nodejs-original.svg"
        ],
        article: 'Работа над страницей с поисковиком для конспектов лекций и ответов на тесты потребовала разработки эффективного алгоритма индексации и ранжирования контента. Особенно интересно было внедрить возможности семантического поиска, которые позволили студентам находить материалы не только по ключевым словам, но и по смысловому соответствию, значительно облегчая подготовку к экзаменам.',
    },
]

